УправлениеИТФирмой_First/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеИТФирмой_First/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеИТФирмой_First/src/Catalogs/Номенклатура/ManagerModule.bsl
Процедура ПрайсЛист(ТабДок, МассивСсылок) Экспорт	
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПрайсЛист)
	Макет = Справочники.Номенклатура.ПолучитьМакет("ПрайсЛист");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Дата = ТекущаяДата();
	ТабДок.Вывести(Шапка);
	
	ТабличнаяЧастьСтрока = Макет.ПолучитьОбласть("ТабличнаяЧастьСтрока");
	
	Для Каждого СтрокаСписка Из МассивСсылок Цикл
		ТабличнаяЧастьСтрока.Параметры.Номенклатура = СтрокаСписка;
		ТабличнаяЧастьСтрока.Параметры.Цена = РегистрыСведений.Цены.ПолучитьПоследнее(, Новый Структура("Номенклатура", СтрокаСписка)).Цена;
		ТабДок.Вывести(ТабличнаяЧастьСтрока); 
	КонецЦикла;
	
	
	//ДанныеДляПечати = ПолучитьДанныеДляПечати(Ссылка);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	Номенклатура.Наименование,
	//|	Номенклатура.ПолноеНаименование,
	//|	Номенклатура.Тип
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	Номенклатура.Ссылка В (&Ссылка)";
	//Запрос.Параметры.Вставить("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//Шапка = Макет.ПолучитьОбласть("Шапка");
	//ТабДок.Очистить();
	//
	//ВставлятьРазделительСтраниц = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	Если ВставлятьРазделительСтраниц Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//	ТабДок.Вывести(ОбластьЗаголовок);
	//	
	//	Шапка.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(Шапка, Выборка.Уровень());
	//	
	//	ВставлятьРазделительСтраниц = Истина;
	//КонецЦикла;
	
	//ЗаполнитьЗначениеСвойств(ОбластьЗаголовок.Параметры, ДанныеДляПечати.ДанныеШапки);
	
	//ТабДок.Вывести(ОбластьЗаголовок);
	//ТабДок.Вывести(ОбластьНачалаТаблицы);

	//ВставлятьРазделительСтраниц = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	Если ВставлятьРазделительСтраниц Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;

	//	ТабДок.Вывести(ОбластьЗаголовок);

	//	Шапка.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(Шапка, Выборка.Уровень());

	//	ВставлятьРазделительСтраниц = Истина;
	//КонецЦикла;
	//}}       
КонецПроцедуры
